# IsCurveReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..IsCurveReference Method
Form Class See Also
---
Tell if the pick is the reference to a curve of the form.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsCurveReference(
	Reference curveReference
)
```

Visual Basic
---
```text
Public Function IsCurveReference ( _
	curveReference As Reference _
) As Boolean
```

Visual C++
---
```text
public:
bool IsCurveReference(
	Reference^ curveReference
)
```

# ### Parameters
curveReference
    Type: Autodesk.Revit.DB..::..ReferenceReference to be checked.
# See Also
Form Class
Autodesk.Revit.DB Namespace